<?php

echo "<h1>Regular Expressions</h1>";


// ****************************************************************
echo "<br>";


echo "<h2>What is a Regular Expression</h2>";


echo "<h5>Նիշերի հաջորդականությունն է,որը կազմում է որոնման օրինաչափություն։Երբ որոնում ենք տվյալներ տեքստում,կարող եք օգտ․ այս որոնման օրինաչափություն։Նկարագրելու համար,թէ ինչ ենք փնտրում։</h5>";


// ****************************************************************
echo "<br>";

echo "<h2>Syntax</h2>";

echo "<h5>regular expression-ը տողեր են,որոնք կազմված են սահամանազատողներից,օրինակ և կամընտիր ձևափոխիչներից։</h5>";

echo '$exp = "/w3schools/i";';

echo "<h5>օրինակում սահամանազատիչ / է, w3schools-ը այն օրինաչափություն է,որը որոնվում է և փոփոխիչ է,որը որոնումը դարձնում է մեծատառերի զգայուն։</h5>";



// ****************************************************************
echo "<br>";

echo "<h2>Regular Expression Functions</h2>";

echo "<h5>PHP-ն ապահովում է մի շարք function-ներ, որոնք թույլ են տալիս օգտ․կանոնավոր արտահայտություններ։preg_match() և preg_match_all() և preg_replace() ամենատարծվածն են։</h5>";




?>