<?php

echo "<h1>STRING FUNCTION</h1>";

// strlen() function
$x = "strlen";
echo (strlen($x));
echo " - վերադարձնում է տողի երկարությունը:";
echo "<br>";

// ****************************************************************

// str_word_count() function
$y = "str_word_count";
echo (str_word_count($y));
echo " - վերադարձնում է տողի բառերի քանակը։";
echo "<br>";

// ****************************************************************

// strrev() function
$z = "strrev";
echo (strrev($z));
echo " - հակադարձում է տողը։";
echo "<br>";

// ****************************************************************

$a = "str pos";
echo (strpos($a, "pos"));
echo " - որոնում է կոնկրետ տեքստ տողի մեջ, եթե գտվել է վերադարձնում է առաջին համընկման նիշերի դիրքը, եթե ոչ ապա վերադարձնում է FALSE։";
echo "<br>";

// ****************************************************************

// str_replace() function
$t = "world";
echo (str_replace($t, "Dolly", "Hello world"));
echo " - որոշ այլ նիշեր փոխարինում է տողի որոշ այլ նիշերով։";



?>